# Práctica 7 - Carga de Datos
Ejercicio completo desde Jupyter Notebook usando pandas, API, y MySQL (simulado).

In [9]:
!pip install mysql-connector-python

# Importa la función para crear el motor de conexión a la base de datos
from sqlalchemy import create_engine
# Crea el motor de conexión a MySQL con tus datos de acceso
engine = create_engine("mysql+mysqlconnector://root:Mv7767572@localhost/tarea")
# Exporta el DataFrame 'df' a la tabla 'salaries_temp' en MySQL
# Si la tabla existe, la reemplaza. No incluye el índice del DataFrame.
df.to_sql(name='salaries_temp', con=engine, if_exists='replace', index=False)
print("Datos exportados exitosamente a MySQL")

Requirement already satisfied: mysql-connector-python in c:\users\mvarg\anaconda3\lib\site-packages (9.3.0)
Datos exportados exitosamente a MySQL

In [9]:
# 1. Importación de Datos desde archivo CSV
import pandas as pd
df = pd.read_csv('salaries.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2025.0,SE,FT,Data Product Owner,170000.0,USD,170000.0,US,0.0,US,M
2,2025.0,SE,FT,Data Product Owner,110000.0,USD,110000.0,US,0.0,US,M
3,2025.0,SE,FT,Data Product Owner,170000.0,USD,170000.0,US,0.0,US,M
4,2025.0,SE,FT,Data Product Owner,110000.0,USD,110000.0,US,0.0,US,M

In [2]:
# 2. Limpieza de Datos
df = df.drop_duplicates()
df = df.dropna()
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1,2025.0,SE,FT,Data Product Owner,170000.0,USD,170000.0,US,0.0,US,M
2,2025.0,SE,FT,Data Product Owner,110000.0,USD,110000.0,US,0.0,US,M
5,2025.0,SE,FT,Engineer,143000.0,USD,143000.0,US,0.0,US,M
6,2025.0,SE,FT,Engineer,106000.0,USD,106000.0,US,0.0,US,M
7,2025.0,SE,FT,Manager,360200.0,USD,360200.0,US,0.0,US,M

In [3]:
# 3. Transformación de Datos
df['salary_range'] = pd.cut(df['salary_in_usd'],
                            bins=[0, 50000, 150000, float('inf')],
                            labels=['Bajo', 'Medio', 'Alto'])
df[['job_title', 'salary_in_usd', 'salary_range']].head()

            job_title  salary_in_usd salary_range
1  Data Product Owner       170000.0         Alto
2  Data Product Owner       110000.0        Medio
5            Engineer       143000.0        Medio
6            Engineer       106000.0        Medio
7             Manager       360200.0         Alto

## Ejercicio 2 - Obtener Datos desde una API

In [20]:
# 1. Importar desde API
import requests # Librería para hacer peticiones HTTP
import pandas as pd  # Librería para trabajar con datos tabulares
# Hacer la solicitud GET a la API
url = 'https://jsonplaceholder.typicode.com/users'
response = requests.get(url)
# Convertir la respuesta en formato JSON a un diccionario/lista de Python
api_data = response.json()
# Crear un DataFrame con los datos obtenidos
df_api = pd.DataFrame(api_data)
df_api.head()

,id,name,username,email,address,phone,website,company
0,1,Leanne Graham,Bret,Sincere@april.biz,"{'street': 'Kulas Light', 'suite': 'Apt. 556',...",1-770-736-8031 x56442,hildegard.org,"{'name': 'Romaguera-Crona', 'catchPhrase': 'Mu..."
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,"{'street': 'Victor Plains', 'suite': 'Suite 87...",010-692-6593 x09125,anastasia.net,"{'name': 'Deckow-Crist', 'catchPhrase': 'Proac..."
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,"{'street': 'Douglas Extension', 'suite': 'Suit...",1-463-123-4447,ramiro.info,"{'name': 'Romaguera-Jacobson', 'catchPhrase': ..."
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,"{'street': 'Hoeger Mall', 'suite': 'Apt. 692',...",493-170-9623 x156,kale.biz,"{'name': 'Robel-Corkery', 'catchPhrase': 'Mult..."
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,"{'street': 'Skiles Walks', 'suite': 'Suite 351...",(254)954-1289,demarco.info,"{'name': 'Keebler LLC', 'catchPhrase': 'User-c..."

In [21]:
# 2. Limpieza de Datos API
df_api = df_api[['id', 'name', 'email']]
df_api.head()

   id              name                      email
0   1     Leanne Graham          Sincere@april.biz
1   2      Ervin Howell          Shanna@melissa.tv
2   3  Clementine Bauch         Nathan@yesenia.net
3   4  Patricia Lebsack  Julianne.OConner@kory.org
4   5  Chelsey Dietrich   Lucio_Hettinger@annie.ca

In [25]:
# 3. Transformación
# Convertir todos los nombres de la columna 'name' a mayúsculas
df_api['name'] = df_api['name'].str.upper()
df_api.head()

   id              name                      email
0   1     LEANNE GRAHAM          Sincere@april.biz
1   2      ERVIN HOWELL          Shanna@melissa.tv
2   3  CLEMENTINE BAUCH         Nathan@yesenia.net
3   4  PATRICIA LEBSACK  Julianne.OConner@kory.org
4   5  CHELSEY DIETRICH   Lucio_Hettinger@annie.ca

In [23]:
# Mostrar las primeras 5 filas del DataFrame transformado
print(df_api.head())
# Mostrar los nombres de las columnas disponibles en el DataFrame
print(df_api.columns)

   id              name                      email
0   1     LEANNE GRAHAM          Sincere@april.biz
1   2      ERVIN HOWELL          Shanna@melissa.tv
2   3  CLEMENTINE BAUCH         Nathan@yesenia.net
3   4  PATRICIA LEBSACK  Julianne.OConner@kory.org
4   5  CHELSEY DIETRICH   Lucio_Hettinger@annie.ca
Index(['id', 'name', 'email'], dtype='object')

In [24]:
# 4. Exportar a CSV
import os# Módulo para trabajar con rutas de archivos

# Opción 1: Guardar el archivo en la carpeta del usuario
output_path = os.path.join(os.path.expanduser("~"), "datos_api_limpios.csv")
df_api.to_csv(output_path, index=False)  # Exporta sin el índice del DataFrame

# Opción 2: Guardar en el directorio actual (por ejemplo, donde está tu notebook o script)
# Si el archivo ya está abierto (por ejemplo, en Excel), se maneja el error y guarda con otro nombre
try:
    df_api.to_csv('datos_api_limpios.csv', index=False)
except PermissionError:
    # Try with a different filename
    df_api.to_csv('datos_api_limpios_new.csv', index=False)
    print("File saved as 'datos_api_limpios_new.csv' because the original file was locked")